Revit 2027 API
GroupTypeId.EnergyAnalysisRoomSpaceData Property
 Room/Space Data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisRoomSpaceData { get; }
Public Shared ReadOnly Property EnergyAnalysisRoomSpaceData As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisRoomSpaceData {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisRoomSpaceData : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace